def zad1():
    parol = input("Введите пароль: ")
    parol2 = input("Введите пароль повторно: ")
    if parol == parol2:
        print("Пароль принят")
    else:
        print("Пароль не принят")

def zad2():
    a = int(input("Введите номер места: "))
    if a % 2 != 0 and a >= 1 and a <= 35:
        print("Нижнее в купе")
    elif a % 2 == 0 and a >= 1 and a <= 35:
        print("Верхнее в купе")
    elif a % 2 != 0 and a >=36 and a <= 54:
        print("Нижнее боковое")
    elif a % 2 == 0 and a >= 36 and a <= 54:
        print("Верхнее боковое")

def zad3():
    a = int(input("Введите год: "))
    if a % 4 == 0 and a % 100 != 0 or a % 400 == 0:
        print(f"год {a} високосный")
    else:
        print("Это год не високосный")

def zad4():
    a = input("Введите цвет: ")
    b = input("Введите цвет: ")
    if a == "красный" and b == "синий" or a == "синий" and b == "красный":
        print("если смешать красный и синий, то получится фиолетовый")
    elif a == "красный" and b == "желтый" or a == "желтый" and b == "красный":
        print("если смешать красный и желтый, то получится оранжевый")
    elif a == "синий" and b == "желтый" or a == "желтый" and b == "синий":
        print("если смешать синий и желтый, то получится зеленый")
    elif a != "красный" or a != "желтый" or a != "синий" and b != "красный" or b != "желтый" or b != "синий":
        print("ошибка!")

zad4()

